In [1]:
!pip install pandas
!pip install sklearn

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Requirement already satisfied: sklearn in /usr/local/lib/python3.7/dist-packages (0.0)
Requirement already satisfied: scikit-learn in /usr/local/lib/python3.7/dist-packages (from sklearn) (1.0.1)
Requirement already satisfied: joblib>=0.11 in /usr/local/lib/python3.7/dist-packages (from scikit-learn->sklearn) (1.1.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in /usr/local/lib/python3.7/dist-packages (from scikit-learn->sklearn) (3.0.0)
Requirement already satisfied: scipy>=1.1.0 in /usr/local/lib/python3.7/dist-packages (from scikit-learn->sklearn) (1.4.1)
Requirement already satisfied: numpy>=1.14.6 in /usr/local/lib/python3.7/dist-packages (from scikit-learn->sklearn) (1.19.5)

In [2]:
import pandas as pd 
from sklearn.linear_model import LogisticRegression 
from sklearn.model_selection import cross_val_score
from sklearn.naive_bayes import GaussianNB
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import VotingClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVC

import numpy as np

df_train=pd.read_csv("/content/drive/MyDrive/train.csv")
df_test=pd.read_csv("/content/drive/MyDrive/test.csv")

In [3]:
df_train.head(66)

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0             1         0       3  ...   7.2500   NaN         S
1             2         1       1  ...  71.2833   C85         C
2             3         1       3  ...   7.9250   NaN         S
3             4         1       1  ...  53.1000  C123         S
4             5         0       3  ...   8.0500   NaN         S
..          ...       ...     ...  ...      ...   ...       ...
61           62         1       1  ...  80.0000   B28       NaN
62           63         0       1  ...  83.4750   C83         S
63           64         0       3  ...  27.9000   NaN         S
64           65         0       1  ...  27.7208   NaN         C
65           66         1       3  ...  15.2458   NaN         C

[66 rows x 12 columns]

In [4]:
# Function to get the mean age...

def mean_age(list_of_ages):
  sum_of_ages = sum(list_of_ages)
  mean_of_ages = sum_of_ages / len(list_of_ages)
  return round(mean_of_ages, 0)

In [5]:
# Function to replace nan age values with the mean age of people who share the same title (e.g. "Master", "Mrs" etc.)

def replace_mean_age(name):
  # Gets everyone in the train dataset with a certain string in their name
  name_index_list = []
  for idx in range(len(df_train)):
    if name in str(df_train["Name"].iloc[[idx]]):
      name_index_list.append(idx)

  # Gets the ages of all those with the specified string in their name

  name_age_list = []
  for idx in range(len(name_index_list)):
    row = df_train.iloc[name_index_list[idx]]["Age"]
    name_age_list.append(row)

  # Same exact process but applied to the test dataset

  name_index_list_2 = []
  for idx in range(len(df_test)):
    if name in str(df_test["Name"].iloc[[idx]]):
      name_index_list_2.append(idx)

  name_age_list_2 = []
  for idx in range(len(name_index_list_2)):
    row = df_test.iloc[name_index_list_2[idx]]["Age"]
    name_age_list_2.append(row)
  
  # Joins both lists and removes any instances of nan

  name_age_list.extend(name_age_list_2)
  without_nan_age = [x for x in name_age_list if str(x) != "nan"]

  # Gets the mean age of everyone with the specified string in their name

  mean_of_name = mean_age(without_nan_age)

  '''
  If they have the string in their name, and if they have a "nan" age value,
  then their age value becomes the mean age of all the people who share their 
  specified string
  '''

  for idx in range(len(name_index_list)):
    if str(df_train.loc[name_index_list[idx], "Age"]) == "nan":
      df_train.loc[name_index_list[idx], "Age"] = mean_of_name

  for idx in range(len(name_index_list_2)):
    if str(df_test.loc[name_index_list_2[idx], "Age"]) == "nan":
      df_test.loc[name_index_list_2[idx], "Age"] = mean_of_name

  return mean_of_name

In [6]:
replace_mean_age("Master.")
replace_mean_age("Dr.")
replace_mean_age("Mrs.")
replace_mean_age("Miss.")
replace_mean_age("Mr.")

32.0

In [7]:
# Check for any remaining "nan" age values in train and test data

for idx in range(len(df_train)):
  if "NaN" in str(df_train["Age"].iloc[[idx]]):
    print(str(df_train["Age"].iloc[[idx]]))
    print(idx)

for idx in range(len(df_test)):
  if "NaN" in str(df_test["Age"].iloc[[idx]]):
    print(str(df_test["Age"].iloc[[idx]]))
    print(idx)

88   NaN
Name: Age, dtype: float64
88

In [8]:
# If there are still nan values, replace them with the mean of all ages (30.0).

df_train["Age"] = df_train["Age"].fillna(30.0)
df_test["Age"] = df_test["Age"].fillna(30.0)

In [43]:
# Replace male with 0 and female with 1 for skilearn 

df_train["Sex"] = df_train["Sex"].replace("male", 0)
df_train["Sex"] = df_train["Sex"].replace("female", 1)
df_test["Sex"] = df_test["Sex"].replace("male", 0)
df_test["Sex"] = df_test["Sex"].replace("female", 1)

In [14]:
train_data_x = df_train[["Pclass", "Sex", "Age"]]
train_data_x.head(10)

   Pclass  Sex   Age
0       3    0  22.0
1       1    1  38.0
2       3    1  26.0
3       1    1  35.0
4       3    0  35.0
5       3    0  32.0
6       1    0  54.0
7       3    0   2.0
8       3    1  27.0
9       2    1  14.0

In [15]:
train_data_y = df_train[["Survived"]]
train_data_y.head(10)

   Survived
0         0
1         1
2         1
3         1
4         0
5         0
6         0
7         0
8         1
9         1

In [16]:
test_data_x = df_test[["Pclass", "Sex", "Age"]]
test_data_x.head(30)

    Pclass  Sex   Age
0        3    0  34.5
1        3    1  47.0
2        2    0  62.0
3        3    0  27.0
4        3    1  22.0
5        3    0  14.0
6        3    1  30.0
7        2    0  26.0
8        3    1  18.0
9        3    0  21.0
10       3    0  32.0
11       1    0  46.0
12       1    1  23.0
13       2    0  63.0
14       1    1  47.0
15       2    1  24.0
16       2    0  35.0
17       3    0  21.0
18       3    1  27.0
19       3    1  45.0
20       1    0  55.0
21       3    0   9.0
22       1    1  37.0
23       1    0  21.0
24       1    1  48.0
25       3    0  50.0
26       1    1  22.0
27       3    0  22.5
28       1    0  41.0
29       3    0  32.0

In [28]:
clf1 = LogisticRegression()

In [29]:
clf2 = RandomForestClassifier(n_estimators=1000, max_features="sqrt", max_depth=None, min_samples_split=2)

In [30]:
clf3 = GaussianNB()

In [31]:
clf4 = KNeighborsClassifier(n_neighbors=9)

In [32]:
clf5 = SVC(kernel='rbf', probability=True)

In [33]:
eclf = VotingClassifier(estimators=[('lr', clf1), ('rf', clf2), ('gnb', clf3), ('knn', clf4), ('svc', clf5)], voting='hard')

In [34]:
clf1.fit(train_data_x, np.ravel(train_data_y))
clf2.fit(train_data_x, np.ravel(train_data_y))
clf3.fit(train_data_x, np.ravel(train_data_y))
clf4.fit(train_data_x, np.ravel(train_data_y))
clf5.fit(train_data_x, np.ravel(train_data_y))
eclf.fit(train_data_x, np.ravel(train_data_y))

VotingClassifier(estimators=[('lr', LogisticRegression()),
                             ('rf',
                              RandomForestClassifier(max_features='sqrt',
                                                     n_estimators=1000)),
                             ('gnb', GaussianNB()),
                             ('knn', KNeighborsClassifier(n_neighbors=9)),
                             ('svc', SVC(probability=True))])

In [36]:
y_predict = eclf.predict(test_data_x.iloc[[26]])
print(y_predict)

[1]

In [37]:
predictions = []

In [38]:
for idx in range(len(test_data_x)):
  try:
    y_predict = eclf.predict(test_data_x.iloc[[idx]])
  except Exception:
    print(test_data_x.iloc[[idx]])
  y_predict = int(y_predict)
  predictions.append(y_predict)
print(predictions)
print(len(predictions))

[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0]
418

In [39]:
print(type(predictions[0]))

<class 'int'>

In [40]:
passengerids = df_test["PassengerId"].tolist()
print(passengerids)
print(len(passengerids))

[892, 893, 894, 895, 896, 897, 898, 899, 900, 901, 902, 903, 904, 905, 906, 907, 908, 909, 910, 911, 912, 913, 914, 915, 916, 917, 918, 919, 920, 921, 922, 923, 924, 925, 926, 927, 928, 929, 930, 931, 932, 933, 934, 935, 936, 937, 938, 939, 940, 941, 942, 943, 944, 945, 946, 947, 948, 949, 950, 951, 952, 953, 954, 955, 956, 957, 958, 959, 960, 961, 962, 963, 964, 965, 966, 967, 968, 969, 970, 971, 972, 973, 974, 975, 976, 977, 978, 979, 980, 981, 982, 983, 984, 985, 986, 987, 988, 989, 990, 991, 992, 993, 994, 995, 996, 997, 998, 999, 1000, 1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010, 1011, 1012, 1013, 1014, 1015, 1016, 1017, 1018, 1019, 1020, 1021, 1022, 1023, 1024, 1025, 1026, 1027, 1028, 1029, 1030, 1031, 1032, 1033, 1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043, 1044, 1045, 1046, 1047, 1048, 1049, 1050, 1051, 1052, 1053, 1054, 1055, 1056, 1057, 1058, 1059, 1060, 1061, 1062, 1063, 1064, 1065, 1066, 1067, 1068, 1069, 1070, 1071, 1072, 1073, 1074, 1075, 1076, 1077, 1078, 1079, 1080, 1081, 1082, 1083, 1084, 1085, 1086, 1087, 1088, 1089, 1090, 1091, 1092, 1093, 1094, 1095, 1096, 1097, 1098, 1099, 1100, 1101, 1102, 1103, 1104, 1105, 1106, 1107, 1108, 1109, 1110, 1111, 1112, 1113, 1114, 1115, 1116, 1117, 1118, 1119, 1120, 1121, 1122, 1123, 1124, 1125, 1126, 1127, 1128, 1129, 1130, 1131, 1132, 1133, 1134, 1135, 1136, 1137, 1138, 1139, 1140, 1141, 1142, 1143, 1144, 1145, 1146, 1147, 1148, 1149, 1150, 1151, 1152, 1153, 1154, 1155, 1156, 1157, 1158, 1159, 1160, 1161, 1162, 1163, 1164, 1165, 1166, 1167, 1168, 1169, 1170, 1171, 1172, 1173, 1174, 1175, 1176, 1177, 1178, 1179, 1180, 1181, 1182, 1183, 1184, 1185, 1186, 1187, 1188, 1189, 1190, 1191, 1192, 1193, 1194, 1195, 1196, 1197, 1198, 1199, 1200, 1201, 1202, 1203, 1204, 1205, 1206, 1207, 1208, 1209, 1210, 1211, 1212, 1213, 1214, 1215, 1216, 1217, 1218, 1219, 1220, 1221, 1222, 1223, 1224, 1225, 1226, 1227, 1228, 1229, 1230, 1231, 1232, 1233, 1234, 1235, 1236, 1237, 1238, 1239, 1240, 1241, 1242, 1243, 1244, 1245, 1246, 1247, 1248, 1249, 1250, 1251, 1252, 1253, 1254, 1255, 1256, 1257, 1258, 1259, 1260, 1261, 1262, 1263, 1264, 1265, 1266, 1267, 1268, 1269, 1270, 1271, 1272, 1273, 1274, 1275, 1276, 1277, 1278, 1279, 1280, 1281, 1282, 1283, 1284, 1285, 1286, 1287, 1288, 1289, 1290, 1291, 1292, 1293, 1294, 1295, 1296, 1297, 1298, 1299, 1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308, 1309]
418

In [41]:
dictionary_of_lists = {"PassengerId": passengerids, "Survived": predictions}
final_dataframe = pd.DataFrame(dictionary_of_lists)
final_dataframe.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [42]:
final_dataframe.to_csv("predictions5.csv", index=False)